<a href="https://colab.research.google.com/github/ThisPoptato/bootcamp_project/blob/main/nycflight13_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Transformation
5 questions to find insight by dplyr

1.   Where is location has more deley flight on department & arriving?
2.   Which top cariers used each month?
3.   Where do most of the flights from and go ?
4.   Where is most destination on December?
5.   Which carrier fly to Atlanta International Airport the most in December 2013

Install package    1. nycflights13    2. tidyverse   3. RPostgreSQL

In [ ]:
install.packages(c("nycflights13","tidyverse","RPostgreSQL"))
library(nycflights13)
library(tidyverse)
library(RPostgreSQL)

Installing packages into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Prepare data

In [ ]:
df <- flights %>% 
  rownames_to_column() %>%
  left_join(airlines,by = c("carrier" = "carrier")) %>%
  rename(carriers = name)

glimpse(df)
tibble(df) %>%
head(5)
apply(df, MARGIN=2,function(col) sum(is.na(col)))

Rows: 336,776
Columns: 21
$ rowname        <chr> "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"…
$ year           <int> 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2…
$ month          <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1…
$ day            <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1…
$ dep_time       <int> 517, 533, 542, 544, 554, 554, 555, 557, 557, 558, 558, …
$ sched_dep_time <int> 515, 529, 540, 545, 600, 558, 600, 600, 600, 600, 600, …
$ dep_delay      <dbl> 2, 4, 2, -1, -6, -4, -5, -3, -3, -2, -2, -2, -2, -2, -1…
$ arr_time       <int> 830, 850, 923, 1004, 812, 740, 913, 709, 838, 753, 849,…
$ sched_arr_time <int> 819, 830, 850, 1022, 837, 728, 854, 723, 846, 745, 851,…
$ arr_delay      <dbl> 11, 20, 33, -18, -25, 12, 19, -14, -8, 8, -2, -3, 7, -1…
$ carrier        <chr> "UA", "UA", "AA", "B6", "DL", "UA", "B6", "EV", "B6", "…
$ flight         <int> 1545, 1714, 1141, 725, 461, 1696, 507, 5708, 79, 301, 4…
$ tailnum        <chr> "N14228", "N24211", "N619AA", "N804JB", "N668DN", "N394…
$ origin         <chr> "EWR", "LGA", "JFK", "JFK", "LGA", "EWR", "EWR", "LGA",…
$ dest           <chr> "IAH", "IAH", "MIA", "BQN", "ATL", "ORD", "FLL", "IAD",…
$ air_time       <dbl> 227, 227, 160, 183, 116, 150, 158, 53, 140, 138, 149, 1…
$ distance       <dbl> 1400, 1416, 1089, 1576, 762, 719, 1065, 229, 944, 733, …
$ hour           <dbl> 5, 5, 5, 5, 6, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 6, 6, 6…
$ minute         <dbl> 15, 29, 40, 45, 0, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 0…
$ time_hour      <dttm> 2013-01-01 05:00:00, 2013-01-01 05:00:00, 2013-01-01 0…
$ carriers       <chr> "United Air Lines Inc.", "United Air Lines Inc.", "Amer…

  rowname year month day dep_time sched_dep_time dep_delay arr_time
1 1       2013 1     1   517      515             2         830
2 2       2013 1     1   533      529             4         850
3 3       2013 1     1   542      540             2         923
4 4       2013 1     1   544      545            -1        1004
5 5       2013 1     1   554      600            -6         812
  sched_arr_time arr_delay ⋯ flight tailnum origin dest air_time distance hour
1  819            11       ⋯ 1545   N14228  EWR    IAH  227      1400     5
2  830            20       ⋯ 1714   N24211  LGA    IAH  227      1416     5
3  850            33       ⋯ 1141   N619AA  JFK    MIA  160      1089     5
4 1022           -18       ⋯  725   N804JB  JFK    BQN  183      1576     5
5  837           -25       ⋯  461   N668DN  LGA    ATL  116       762     6
  minute time_hour           carriers
1 15     2013-01-01 05:00:00 United Air Lines Inc.
2 29     2013-01-01 05:00:00 United Air Lines Inc.
3 40     2013-01-01 05:00:00 American Airlines Inc.
4 45     2013-01-01 05:00:00 JetBlue Airways
5  0     2013-01-01 06:00:00 Delta Air Lines Inc.

       rowname           year          month            day       dep_time
             0              0              0              0           8255
sched_dep_time      dep_delay       arr_time sched_arr_time      arr_delay
             0           8255           8713              0           9430
       carrier         flight        tailnum         origin           dest
             0              0           2512              0              0
      air_time       distance           hour         minute      time_hour
          9430              0              0              0              0
      carriers
             0

# Question 1 - Where is location has more deley flight on department & arriving?

*   Answer 	
           origin most deley = John F Kennedy Intl	date: 09/01/2013
           department most delat = Honolulu Intl date: 09/01/2013
           cause of delay is not storm.

In [ ]:
q1 <- df 
or <- q1 %>%
left_join(airports,by = c("origin" = "faa")) %>%
rename(origins = name) %>%
select(rowname,year,month,day,origins,dep_delay) %>%
group_by(origins) %>%
arrange(desc(dep_delay)) %>%
head(1)

de <- q1 %>%
left_join(airports,by = c("dest" = "faa")) %>%
rename(dests = name) %>%
select(rowname,year,month,day,dests,arr_delay) %>%
group_by(dests) %>%
arrange(desc(arr_delay)) %>%
head(1)

tt <- list(or,de)
bind_rows(tt)

  rowname year month day origins             dep_delay dests         arr_delay
1 7073    2013 1     9   John F Kennedy Intl 1301      NA              NA
2 7073    2013 1     9   NA                    NA      Honolulu Intl 1272

# Question 2 - Which top cariers used each month?

*   Answer 	
           Jan - United Air Lines Inc.
           Feb - United Air Lines Inc.
           Mar - United Air Lines Inc.
           Apr - United Air Lines Inc.
           May - United Air Lines Inc.
           Jun - United Air Lines Inc.
           Jur - United Air Lines Inc.
           Aug - United Air Lines Inc.
           Sep - ExpressJet Airlines Inc.
           Oct - United Air Lines Inc.
           Nov - United Air Lines Inc.
           Dec - United Air Lines Inc.

           But most top 3 each month in 2013 are United Air Lines Inc., ExpressJet Airlines Inc., JetBlue Airways

In [ ]:
q2 <- df  %>%
group_by(month) %>%
count(carriers) %>%
rename(count = n) %>%
arrange(month,desc(count))

q21 <- q2 %>% # Find top carriers each month of 2013
select(month,carriers,count) %>%
filter(count %in% count[1]) 
q21

q22 <- q2 %>% # Find count of top 3 carriers each month of 2013
select(month,carriers,count) %>%
filter(count %in% count[1:3]) 
q22 %>%
select(carriers,count) %>%
group_by(carriers) %>%
count(carriers) %>%
rename(top3_count = n)

   month carriers                 count
1   1    United Air Lines Inc.    4637
2   2    United Air Lines Inc.    4346
3   3    United Air Lines Inc.    4971
4   4    United Air Lines Inc.    5047
5   5    United Air Lines Inc.    4960
6   6    United Air Lines Inc.    4975
7   7    United Air Lines Inc.    5066
8   8    United Air Lines Inc.    5124
9   9    ExpressJet Airlines Inc. 4725
10 10    United Air Lines Inc.    5060
11 11    United Air Lines Inc.    4854
12 12    United Air Lines Inc.    4931

Adding missing grouping variables: `month`

  carriers                 top3_count
1 ExpressJet Airlines Inc. 12
2 JetBlue Airways          12
3 United Air Lines Inc.    12

# Question 3 - Where do most of the flights from and go ?
*   Answer 	
           
           Most of flight = John F. Kennedy International Airport to 
           Los Angeles International Airport (JFK to LAX) 
           Most of them traveled before noon and air time in flight average is 
           327.6364.

In [ ]:
df %>% # Find Most of flight
count(origin,dest) %>%
arrange(desc(n)) %>%
head(3) 

q3 <- df %>% # Find Time most of flight
select(origin,dest,hour,minute,air_time) %>%
group_by(origin,dest,hour,minute) %>%
filter(!is.na(air_time)) %>%
filter(origin == "JFK" & dest == "LAX") %>%
summarise(total = sum(!is.na(origin)),
           h = mean(air_time)) %>%
arrange(desc(by = total)) %>% 
head(5) 
q3

  origin dest n
1 JFK    LAX  11262
2 LGA    ATL  10263
3 LGA    ORD   8857

`summarise()` has grouped output by 'origin', 'dest', 'hour'. You can override
using the `.groups` argument.

  origin dest hour minute total h
1 JFK    LAX  12    0     726   327.6364
2 JFK    LAX   7    0     686   328.6224
3 JFK    LAX   9    0     561   331.0053
4 JFK    LAX  13   45     360   330.0778
5 JFK    LAX  16   55     360   335.2528

# Question 4 - Where is most destination on December?
*   Answer 	
           
           1.ATL - Atlanta International Airport
           2.LAX - Los Angeles International Airport
           3.MCO - Orlando International Airport

In [ ]:
q4 <- df %>%
select(month,dest) %>%
group_by(dest) %>%
filter(month == 12) %>%
summarise(total = sum(!is.na(dest))) %>%
arrange(desc(by = total)) %>%
head(3)
q4

  dest total
1 ATL  1463
2 LAX  1408
3 MCO  1219

Question 5 - Which carrier fly to Atlanta International Airport the most in December 2013

In [ ]:
q5 <- df %>%
select(month,dest,carriers) %>%
group_by(carriers,dest) %>%
filter(month == 12,dest == "ATL") %>%
summarise(total = sum(!is.na(dest))) %>%
arrange(desc(by = total))
q5

`summarise()` has grouped output by 'carriers'. You can override using the
`.groups` argument.

  carriers                    dest total
1 Delta Air Lines Inc.        ATL  946
2 Envoy Air                   ATL  189
3 AirTran Airways Corporation ATL  153
4 ExpressJet Airlines Inc.    ATL  131
5 Southwest Airlines Co.      ATL   31
6 United Air Lines Inc.       ATL   13

In [ ]:
con <- dbConnect(
  PostgreSQL(),
  host = "arjuna.db.elephantsql.com",
  dbname = "hbxrjoub",
  port = 5432,
  user = "hbxrjoub",
  password = "YOV9Yn2F87PUU3Gr6fwWRZuxsfOxQcbC" )

In [ ]:
dbWriteTable(con,"dep_delay", or)
dbWriteTable(con,"arr_delay", de)
dbWriteTable(con,"top_carrier", q21)
dbWriteTable(con,"most_flight", q3)
dbWriteTable(con,"dest_dec", q4)
dbWriteTable(con,"atl_carrier_dec", q5)

New names:
• `` -> `...1`
Warning message in postgresqlWriteTable(conn, name, value, ...):
“table dep_delay exists in database: aborting assignTable”

[1] FALSE

New names:
• `` -> `...1`
Warning message in postgresqlWriteTable(conn, name, value, ...):
“table arr_delay exists in database: aborting assignTable”

[1] FALSE

New names:
• `` -> `...1`
Warning message in postgresqlWriteTable(conn, name, value, ...):
“table top_carrier exists in database: aborting assignTable”

[1] FALSE

New names:
• `` -> `...1`
Warning message in postgresqlWriteTable(conn, name, value, ...):
“table most_flight exists in database: aborting assignTable”

[1] FALSE

Warning message in postgresqlWriteTable(conn, name, value, ...):
“table dest_dec exists in database: aborting assignTable”

[1] FALSE

New names:
• `` -> `...1`

[1] TRUE

In [ ]:
dbListTables(con)

 [1] "student"     "cars"        "aaaa"        "bbbb"        "cccc"
 [6] "dddd"        "dep_delay"   "arr_delay"   "top_carrier" "most_flight"
[11] "dest_dec"

In [ ]:
dbGetQuery(con, "SELECT * FROM dep_delay UNION SELECT * FROM arr_delay")
dbGetQuery(con, "SELECT * FROM top_carrier")
dbGetQuery(con, "SELECT * FROM most_flight LIMIT 5")
dbGetQuery(con, "SELECT * FROM dest_dec")
dbGetQuery(con, "SELECT * FROM atl_carrier_dec")

  row.names rowname year month day origins             dep_delay
1 1         7073    2013 1     9   John F Kennedy Intl 1301
2 1         7073    2013 1     9   Honolulu Intl       1272

   row.names month carriers                 count
1  1          1    United Air Lines Inc.    4637
2  2          2    United Air Lines Inc.    4346
3  3          3    United Air Lines Inc.    4971
4  4          4    United Air Lines Inc.    5047
5  5          5    United Air Lines Inc.    4960
6  6          6    United Air Lines Inc.    4975
7  7          7    United Air Lines Inc.    5066
8  8          8    United Air Lines Inc.    5124
9  9          9    ExpressJet Airlines Inc. 4725
10 10        10    United Air Lines Inc.    5060
11 11        11    United Air Lines Inc.    4854
12 12        12    United Air Lines Inc.    4931

  row.names origin dest hour minute total h
1 1         JFK    LAX  12    0     726   327.6364
2 2         JFK    LAX   7    0     686   328.6224
3 3         JFK    LAX   9    0     561   331.0053
4 4         JFK    LAX  13   45     360   330.0778
5 5         JFK    LAX  16   55     360   335.2528

  row.names dest total
1 1         ATL  1463
2 2         LAX  1408
3 3         MCO  1219

  row.names carriers                    dest total
1 1         Delta Air Lines Inc.        ATL  946
2 2         Envoy Air                   ATL  189
3 3         AirTran Airways Corporation ATL  153
4 4         ExpressJet Airlines Inc.    ATL  131
5 5         Southwest Airlines Co.      ATL   31
6 6         United Air Lines Inc.       ATL   13

In [ ]:
dbDisconnect(con)

[1] TRUE